Revit 2027 API
ConnectionInputPoint Properties
The ConnectionInputPoint type exposes the following members.
Properties
Name | Description
Id |  Unique id of this input point.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Point |  3d position of this input point.
Top
See Also
Reference
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace